{
  "title": "Web Application for Performing Principal Component Analysis, Distances, Clustering and Outlier Detection.",
  "student1": "Student",
  "student2": "Tutors",
  "menu1": "Introduction",
  "menu2": "Start",
  "menu3": "Data",
  "menu4": "PCA",
  "menu5": "Distances",
  "menu6": "Clustering",
  "menu7": "Outliers",
  "information1": "Introduction to the topic",
  "information2": "The objective of this project is to develop a web application that allows users to perform a comprehensive data set analysis provided by themselves. The application focuses on four analysis techniques: Principal Components, Distances, Clustering and Outlier Detection. In particular, the application provides the following use cases:",
  "information2.1": "In particular, the application provides the following use cases:",
  "information3": "Obtain the data entered by the user.",
  "information4": "Carry out a principal component analysis.",
  "information5": "Carry out a distance analysis (Euclidean, normalized Euclidean and Mahalanobis).",
  "information6": "Carry out a clustering analysis (DBSCAN, OPTICS and K-means).",
  "information7": "Detect outliers in the data using the (Mahalanobis, DBSCAN, OPTICS, KNN and LOF) algorithms.",
  "information8": "The web application is available to the scientific community free of charge and under a GNU GPL 3.0 license.",
  "information9": "Basic usage instructions:",
  "information10": "To properly use the web application, the user must first enter the data to be worked with in the",
  "information11": "Start > Data",
  "information12": " tab, this can be done manually or by uploading an .xlsx file.",
  "information13": "Once the data upload is completed, the user will be able to interact with the ",
  "information14": "PCA, ",
  "information15": "Distances, ",
  "information16": "Clustering ",
  "information17": "and ",
  "information18": "Outliers ",
  "information19": "tabs, being able to perform the different analyzes corresponding to each window. Finally, in each window the user will be able to save a copy of the data obtained during execution.",
  "data1": "Data entry",
  "data2": "Number of variables",
  "data3": "Enter a value",
  "data4": "Submit",
  "data5": "Please choose a number less than 10 and greater than 0.",
  "data6": "To enter more than 10 variables, use an Excel file in .xlsx format",
  "data7": "Select file",
  "data8": "Remember that the file must be an Excel type (.xlsx) and the first row must contain the variable names.",
  "data9": "Enter the names of the different variables:",
  "data10": "Variable",
  "data11": "Enter the variable values:",
  "data12": "Enter",
  "data13": "You cannot enter empty values.",
  "data14": "Standardize data",
  "data15": "Delete",
  "data16": "The data must contain an equal or greater number of rows than columns.",
  "data17": "Reset Data",
  "acp1": "Definition",
  "acp2": "PCA (Principal Component Analysis), builds a linear transformation that chooses a new coordinate system for the original dataset whose largest variance is fixed on the first axis (called the first principal component), the largest variance in second place on the second axis and so on. To build this linear transformation, you must first build the covariance matrix or the coefficient of correlation matrix. Due to the symmetry of this matrix, there is an adequate basis for its eigenvectors. The transformation that converts the old coordinates into the coordinates of the new base is a linear transformation necessary to reduce the dimensionality of the data. In addition, the coordinates in the new data base produce the underlying factorial component of the original data.",
  "acp3": "PCA is especially useful for reducing the size of datasets. The first principal components describe most of the variance in the data (the more closely correlated the initial variables are). These subsections sometimes contain the most important aspect of the information and other elements can be omitted. There are different methods to estimate the number of significant principal components; The most appropriate method will depend on the correlation structure in the original data.",
  "acp4": "Enter the number of principal components:",
  "acp5": "Number of PCs",
  "acp6": "Submit",
  "acp7": "Remember that to obtain the graphs, the number of PC must be 2 or 1.",
  "acp8": "The new number of principal components, must be less than the number of variables in the original table.",
  "acp9": "Final data:",
  "acp10": "Standardize",
  "acp11": "De-standardize",
  "acp12": "Standardized Final Data:",
  "acp13": "Projections on the Principal Components",
  "acp14": "Hide",
  "acp14.2": "Show",
  "acp15": "Standardized projections on the Principal Components",
  "acp16": "Properties",
  "acp17": "Variance",
  "acp18": "Eigenvalues",
  "acp19": "Standard Deviation ",
  "acp20": "Eigenvectors",
  "distances1": "Definition",
  "distances2": "The distance between two points is a measure that quantifies the separation or difference between them, regardless of the number of dimensions in which they are found. It can be calculated using different methods, such as Euclidean distance or Manhattan distance, among others. These methods evaluate the differences or distances between the coordinates of the points in each dimension and provide a numerical value that represents the magnitude of the spatial separation between them. Distance is a fundamental tool in mathematics, physics, data science and other fields, and is used to compare objects, analyze patterns, make decisions and solve problems in various contexts.",
  "distances3": "Those distance tables whose dimensions are greater than 20x20, should be downloaded to be viewed in full.",
  "distances4": "Choose the type of distance to apply.",
  "distances5": "Select distance type",
  "distances6": "Euclidean distances:",
  "distances7": "Normalized Euclidean distances:",
  "distances8": "Mahalanobis distances:",
  "clustering1": "Definition",
  "clustering2": "Clustering, also known as cluster analysis or cluster modeling, is the task of grouping objects based on their similarity. In this way, we can say that the members of each group have similar characteristics. Group analysis originated in anthropology by Driver and Kroeber in 1932 and was introduced to psychology by Zubin in 1938.",
  "clustering3": "This technique is commonly applied in statistical data analysis. There are countless clustering algorithms, where in general, they vary in the way the author considers what a group is and how they are performed.",
  "clustering4": "Choose the type of distance and clustering.",
  "clustering5": "Select distance type",
  "clustering6": "Select clustering type",
  "clustering7": "The maximum distance sets the maximum range of a point's neighborhood. If a point is more than the maximum distance from its nearest neighbor, it is considered an outlier and is not grouped with any cluster. On the other hand, the minimum number of points needed to create a new cluster with points that are within this maximum distance is defined.",
  "clustering8": "Maximum distance",
  "clustering9": "Minimum points per cluster",
  "clustering10": "Submit",
  "clustering11": "There are",
  "clustering12": "clustering groups.",
  "clustering13": "Points",
  "clustering14": "Cluster",
  "clustering15": "Number of clusters",
  "clustering16": "The Minimum number of neighbors parameter is necessary to define what is considered a cluster in the OPTICS algorithm. If a point has at least n neighbors within the Search radius Maximum distance, it is considered a core point and is added to the corresponding cluster. If a point does not have enough neighbors, it is considered an outlier.",
  "clustering17": "Minimum number of neighbors",
  "outliers1": "Definition",
  "outliers2": "An outlier, or atypical value, refers to a data point that is significantly far away from the rest of the data in a set. It can be an unusual, rare or even an measurement error. Outliers are relevant in the context of clustering, which is a data analysis technique that groups similar data points into groups or clusters. Outliers can negatively affect the clustering process since they can introduce noise or bias the results. If an outlier does not represent a pattern or behavior similar to the other data points in a cluster, it can influence how cluster boundaries are determined or even be considered a cluster on its own.",
  "outliers3": "Choose the outlier detection algorithm.",
  "outliers4": "Select outlier type",
  "outliers5": "Maximum distance",
  "outliers6": "Minimum points per cluster",
  "outliers7": "Submit",
  "outliers8": "Coordinates",
  "outliers9": "Number of more distant neighbors",
  "outliers10": "Distance",
  "outliers11": "Minimum number of neighbors"
}
