{
  "title": "Web application for performing principal component analysis, distances, clustering, and outlier detection.",
  "student1": "Student",
  "student2": "Tutors",
  "menu1": "Introduction",
  "menu2": "Get Started",
  "menu3": "Data",
  "menu4": "PCA",
  "menu5": "Distances",
  "menu6": "Clustering",
  "menu7": "Outliers",
  "information2": "The objective of this project is to develop a web application that allows users to perform a comprehensive analysis of data sets provided by themselves. The application focuses on four analysis techniques: Principal Component Analysis, Distances, Clustering, and Outlier Detection.",
  "information2.1": "In particular, the application provides the following use cases:",
  "information3": "Retrieve data inputted by the user.",
  "information4": "Perform a Principal Component Analysis.",
  "information5": "Perform distance analysis (Euclidean, normalized Euclidean, and Mahalanobis).",
  "information6": "Perform clustering analysis (DBSCAN, OPTICS, and K-means).",
  "information7": "Detect outliers in the data using the following algorithms: Mahalanobis, DBSCAN, OPTICS, KNN, and LOF.",
  "information8": "The web application is available to the scientific community for free and under a GNU GPL 3.0 license.",
  "information9": "Basic usage instructions:",
  "information10": "For the correct use of the web application, the user must first enter the data to work with in the tab",
  "information11": "Get Started > Data",
  "information12": ", this can be done manually or by uploading an .xlsx file.",
  "information13": "Once the data upload is done, the user can interact with the tab ",
  "information14": "PCA, ",
  "information15": "Distances, ",
  "information16": "Clustering ",
  "information17": "and ",
  "information18": "Outliers",
  "information19": ", being able to perform the different analyses corresponding to each window. Finally, in each window, the user can save a copy of the data obtained during the execution.",
  "data1": "Data Entry",
  "data2": "Number of Variables",
  "data3": "Enter a value",
  "data4": "Submit",
  "data5": "Please choose a number less than 10 and greater than 0.",
  "data6": "To input more than 10 variables, use an Excel file in .xlsx format.",
  "data7": "Select File",
  "data8": "Remember that the file must be in Excel format (.xlsx), and the first row must contain the variable names.",
  "data9": "Enter the names of the different variables:",
  "data10": "Variable",
  "data11": "Enter the values of the variables:",
  "data12": "Enter",
  "data13": "You cannot enter empty values.",
  "data14": "Standardize Data",
  "data15": "Delete",
  "data16": "The data must have a number of rows greater than or equal to the number of columns.",
  "data17": "Reset Data",
  "acp1": "Definition",
  "acp2": "Principal Component Analysis (PCA) constructs a linear transformation that selects a new coordinate system for the original data set. In this new system, the first axis, or principal component, corresponds to the linear combination of the original variables with the highest variance. Similarly, the second principal component is given by the linear combination with the highest variance once the variance captured by the first principal component has been removed, and so on. The transformation that converts the old coordinates into the coordinates of the new basis is a linear transformation that is essential for reducing the dimensionality of the data. PCA is particularly useful when seeking to reduce the size of data sets. The first principal components capture most of the variance in the data, especially when the initial variables are closely correlated. These principal components often contain the most relevant information, allowing for the omission of less significant elements. Enter the number of principal components:",
  "acp2.1": "The transformation that converts the old coordinates into the coordinates of the new basis is an essential linear transformation for reducing the dimensionality of the data.",
  "acp3": "PCA is particularly useful when aiming to reduce the size of data sets. The first principal components capture the majority of the variance in the data, especially when the initial variables are closely correlated. These principal components often contain the most relevant information, allowing less significant elements to be disregarded.",
  "acp4": "Enter the number of principal components:",
  "acp5": "Number of PC",
  "acp6": "Enter",
  "acp7": "Remember that to obtain the graphs, the number of PCs must be 2 or 1.",
  "acp8": "The new number of principal components must be less than the number of variables in the original table.",
  "acp9": "Final Data:",
  "acp10": "Standardize",
  "acp11": "De-standardize",
  "acp12": "Final Standardized Data:",
  "acp13": "Projections onto Principal Components",
  "acp14": "Hide",
  "acp14.2": "Show",
  "acp15": "Standardized Projections onto Principal Components",
  "acp16": "Properties",
  "acp17": "Variance",
  "acp18": "Eigenvalues",
  "acp19": "Standard Deviation",
  "acp20": "Eigenvectors",
  "distances1": "Definition",
  "distances2": "The concept of distance between two elements serves to quantify their separation or difference, regardless of the number of dimensions they are in. It is calculated using methods such as Euclidean distance or Manhattan distance, among others. These calculations determine the differences between the coordinates of the elements in each dimension, obtaining a numerical value that represents the magnitude of their spatial separation. Distance is a fundamental tool in areas such as mathematics, physics, data science, etc., as it allows for comparing objects, analyzing patterns, making decisions, and solving problems in various contexts.",
  "distances3": "Distance matrices with more than 20x20 rows and columns need to be downloaded to be fully visible.",
  "distances4": "Choose the type of distance to apply.",
  "distances5": "Select the type of distance",
  "distances6": "Euclidean Distances:",
  "distances7": "Normalized Euclidean Distances:",
  "distances8": "Mahalanobis Distances:",
  "clustering1": "Definition",
  "clustering2": "Clustering is used to classify objects into groups based on their similarity, where the members of each group share similar characteristics. Group analysis originated in anthropology by Driver and Kroeber in 1932 and entered psychology through Zubin in 1938.",
  "clustering3": "This technique is commonly applied in statistical data analysis. There are multiple clustering algorithms that generally differ in how they conceive a group and how they are formed.",
  "clustering4": "Choose the type of distance and clustering.",
  "clustering5": "Select the type of distance",
  "clustering6": "Select the type of clustering",
  "clustering7": "The maximum distance sets the maximum range of a point's neighborhood. If a point is at a distance greater than the maximum distance from its nearest neighbor, it is considered an outlier and is not grouped with any cluster. On the other hand, the minimum number of points needed to create a new cluster with points that are within this maximum distance is defined.",
  "clustering8": "Maximum Distance",
  "clustering9": "Minimum Points per group",
  "clustering10": "Enter",
  "clustering11": "There are",
  "clustering12": "clustering groups",
  "clustering13": "Points",
  "clustering14": "Group",
  "clustering15": "Number of clusters",
  "clustering16": "The parameter Minimum Number of Neighbors is required to define what constitutes a cluster in the OPTICS algorithm. If a point has at least n neighbors within the Maximum Search Radius, it is deemed a core point and is assigned to the corresponding cluster. Points without sufficient neighbors are classified as outliers. More specifically, in order for a data point to be considered part of a cluster, rather than an outlier, it must have a minimum number of other points within a specified maximum distance. By setting this minimum neighbor threshold, the OPTICS algorithm determines the boundaries between clusters and outliers in the data. The minimum neighbor parameter thus directly influences how narrowly or broadly clusters are defined.",
  "clustering17": "Minimum Number of Neighbors",
  "outliers1": "Definition",
  "outliers2": "An outlier, also known as an outlier value, refers to a data point that is significantly distant from the rest of the data in a set. This point may be an unusual or rare observation or even a measurement error. The presence of outliers is particularly relevant in the context of clustering, a data analysis technique that aims to group similar data points into clusters. However, outliers can negatively affect the clustering process as they can introduce noise or bias the results. If an outlier does not represent a pattern or behavior similar to the other data points in a cluster, its inclusion can influence how the cluster boundaries are determined or even be considered a cluster on its own.",
  "outliers3": "Choose the outlier detection algorithm.",
  "outliers4": "Select the type of outlier",
  "outliers5": "Maximum Distance",
  "outliers6": "Minimum Points per Group",
  "outliers7": "Enter",
  "outliers8": "Coordinates",
  "outliers9": "Number of Farthest Neighbors",
  "outliers10": "Distance",
  "outliers11": "Minimum Number of Neighbors",
  "datos1": "Destandardize data",
  "datos2": "Standardize data"
}
