{
  "title": "Aplicación web para realizar análisis de componentes principales, distancias, clustering y detección de outliers.",
  "student1": "Alumno",
  "student2": "Tutores",
  "menu1": "Introducción",
  "menu2": "Empezar",
  "menu3": "Datos",
  "menu4": "ACP",
  "menu5": "Distancias",
  "menu6": "Clustering",
  "menu7": "Outliers",
  "information1": "Introducción al tema",
  "information2": "El objetivo de este proyecto es desarrollar una aplicación web que permita a los usuarios realizar un análisis completo de conjuntos de datos proporcionados por ellos mismos. La aplicación se enfoca en cuatro técnicas de análisis: Componentes Principales, Distancias, Clustering y Detección de Outliers. En particular, la aplicación proporciona los siguientes casos de uso:",
  "information2.1": "En particular, la aplicación proporciona los siguientes casos de uso:",
  "information3": "Obtener los datos introducidos por parte del usuario.",
  "information4": "Llevar a cabo un análisis de componentes principales.",
  "information5": "Llevar a cabo un análisis de distancias (Euclidea, Euclida normalizada y Mahalanobis).",
  "information6": "Llevar a cabo un análisis de clustering (DBSCAN, OPTICS y K-means).",
  "information7": "Detectar outliers en los datos mediante los algoritmos (Mahalanobis, DBSCAN, OPTICS, KNN y LOF).",
  "information8": "La aplicación web se está a disposición de la comunidad científica de forma gratuita y bajo una licencia GNU GPL 3.0.",
  "information9": "Instrucciones básicas de uso:",
  "information10": "ara el correcto uso de la aplicación web, el usuario debera primeramente introducir los datos con los que se va a trabajar en la pestaña",
  "information11": "Empezar > Datos",
  "information12": ", esto se puede hacer de forma manual o subiendo un archivo de tipo .xlsx. ",
  "information13": "Una vez realizada la subida de los datos, el usuario podra interactuar con las pestaña ",
  "information14": "ACP, ",
  "information15": "Distancias, ",
  "information16": "Clustering ",
  "information17": "y ",
  "information18": "Outliers",
  "information19": ", pudiendo realizar los diferentes análisis, correspondientes a cada ventana. Finalmente, en cada ventana el usuario podrá guardar una copia de los datos obtenidos durante la ejecución.",
  "data1": "Introducción de datos",
  "data2": "Número de variables",
  "data3": "Introduce un valor",
  "data4": "Enviar",
  "data5": "Por favor, escoge un número menor de 10 y mayor de 0.",
  "data6": "Para introducir más de 10 variables, utilize un fichero de Excel en formato .xlsx",
  "data7": "Seleccionar archivo",
  "data8": "Recuerda que el archivo debe de ser tipo Excel (.xlsx) y la primera fila debe contener el nombre de las variables.",
  "data9": "Introduce el nombre de las diferentes variables:",
  "data10": "Variable",
  "data11": "Introduce el valor de las variables:",
  "data12": "Introducir",
  "data13": "No puedes introducir valores vacios.",
  "data14": "Estandarizar datos",
  "data15": "Eliminar",
  "data16": "Los datos deben de contener un número mayor o igual de filas que de columnas.",
  "data17": "Restablecer Datos",
  "acp1": "Definición",
  "acp2": "ACP (Análisis de Componentes Principales), construye una transformación lineal que elige un nuevo sistema de coordenadas para el conjunto de datos original cuya varianza más grande se fija en el primer eje (llamado el primer componente principal), la varianza grande en segundo lugar en el segundo eje y así sucesivamente. Para construir esta transformación lineal, primero debe construir la matriz de covarianza o la matriz de coeficiente de correlación. Debido a la simetría de esta matriz, existe una base adecuada para sus vectores propios. La transformación que convierte las coordenadas antiguas en las coordenadas de la nueva base es una transformación lineal necesaria para reducir la dimensionalidad de los datos. Además, las coordenadas en la nueva base de datos producen el componente factorial subyacente de los datos originales.",
  "acp3": "ACP es especialmente útil para reducir el tamaño de los conjuntos de datos. Los primeros componentes principales describen la mayor parte de la varianza en los datos (cuanto más estrechamente correlacionadas están las variables iniciales). Estas subsecciones a veces contienen el aspecto más importante de la información y se pueden omitir otros elementos. Existen diferentes métodos para estimar el número de componentes principales significativos; El método más apropiado dependerá de la estructura de correlación en los datos originales.",
  "acp4": "Introduce el número de componentes principales:",
  "acp5": "Numero de CP",
  "acp6": "Introducir",
  "acp7": "Recuerda que para obtener las gráficas, el número de CP debe ser 2 o 1.",
  "acp8": "El nuevo número de componentes principales, tiene que ser menor que el número de variables de la tabla original.",
  "acp9": "Datos Finales:",
  "acp10": "Estandarizar",
  "acp11": "Desestandarizar",
  "acp12": "Datos Finales Estandarizados:",
  "acp13": "Proyecciones sobre los Componentes Principales",
  "acp14": "Ocultar",
  "acp14.2": "Mostrar",
  "acp15": "Proyecciones estandarizadas sobre los Componentes Principales",
  "acp16": "Propiedades",
  "acp17": "Varianza",
  "acp18": "Autovalores",
  "acp19": "Desviación Estandar",
  "acp20": "Autovectores",
  "distances1": "Definición",
  "distances2": "La distancia entre dos puntos es una medida que cuantifica la separación o diferencia entre ellos, independientemente de la cantidad de dimensiones en las que se encuentren. Puede ser calculada mediante diferentes métodos, como la distancia euclidiana o la distancia de Manhattan, entre otros. Estos métodos evalúan las diferencias o distancias entre las coordenadas de los puntos en cada dimensión y proporcionan un valor numérico que representa la magnitud de la separación espacial entre ellos. La distancia es una herramienta fundamental en matemáticas, física, ciencias de datos y otros campos, y se utiliza para comparar objetos, analizar patrones, tomar decisiones y resolver problemas en diversos contextos.",
  "distances3": "Aquellas tablas de distancias cuyas dimensiones sean mayores a 20x20, deberán descargarse para visualizarse de manera completa.",
  "distances4": "Elija el tipo de distancia a aplicar.",
  "distances5": "Seleccione el tipo de distancia",
  "distances6": "Distancias euclideas:",
  "distances7": "Distancias euclideas normalizadas:",
  "distances8": "Distancias de Mahalanobis:",
  "clustering1": "Definición",
  "clustering2": "El Clustering, también conocido como análisis de grupos o agrupamiento, es la tarea encargada de agrupar objetos en función de su similitud. De esta forma, podemos decir que los miembros de cada grupo tienen características similares. El análisis de grupo estuvo originado en antropología por Driver y Kroeber en 1932 e introducido a psicología por Zubin en 1938.",
  "clustering3": "Esta técnica es comúnmente aplicada en el análisis de datos estadísticos. Existen infinidad de algoritmos de agrupamiento, donde por lo general, varían en la forma en la que el al autor considera que es un grupo y como se realizan.",
  "clustering4": "Elija el tipo de distancia y clustering.",
  "clustering5": "Seleccione el tipo de distancia",
  "clustering6": "Seleccione el tipo de clustering",
  "clustering7": "La distancia máxima establece el alcance máximo de la vecindad de un punto. Si un punto está a una distancia mayor que la distancia máxima de su vecino más cercano, se considera como un outlier y no se agrupa con ningún cluster. Por otra parte se define el mínimo de puntos que se necesitan, para crear un nuevo cluster con los puntos que entre ellos estén dentro de esta distancia máxima",
  "clustering8": "Distancia máxima",
  "clustering9": "Puntos mínimos por grupo",
  "clustering10": "Introducir",
  "clustering11": "Existen",
  "clustering12": "grupos de clustering",
  "clustering13": "Puntos",
  "clustering14": "Grupo",
  "clustering15": "Número de clusters",
  "clustering16": "El parámetro Número mínimo de vecinos es necesario para definir qué se considera un cluster en el algoritmo OPTICS. Si un punto tiene al menos n vecinos dentro del radio de búsqueda Distancia máxima, se considera core point y se agrega al cluster correspondiente. Si un punto no tiene suficientes vecinos, se considera outlier.",
  "clustering17": "Número mínimo de vecinos",
  "outliers1": "Definición",
  "outliers2": "Un outlier, o valor atípico, se refiere a un punto de datos que se encuentra significativamente alejado del resto de los datos en un conjunto. Puede ser una observación inusual, rara o incluso un error de medición. Los outliers son relevantes en el contexto del clustering, que es una técnica de análisis de datos que agrupa puntos de datos  similares en grupos o clústeres. Los outliers pueden afectar negativamente el proceso de clustering, ya que pueden introducir ruido o sesgar los resultados. Si un outlier no representa un patrón o comportamiento similar a los demás puntos de datos en un clúster, puede influir en la forma en que se determinan los límites de los clústeres o incluso ser considerado un clúster por sí mismo. ",
  "outliers3": "Escoja el algoritmo de detección de outliers.",
  "outliers4": "Seleccione el tipo de outlier",
  "outliers5": "Distancia máxima",
  "outliers6": "Puntos mínimos por grupo",
  "outliers7": "Introducir",
  "outliers8": "Coordenadas",
  "outliers9": "Número de vecinos más alejados",
  "outliers10": "Distancia",
  "outliers11": "Número mínimo de vecinos"
}
